Repository: vicproj/Puppy
Catalog: langpack/*/usr/share/locale/*/LC_MESSAGES/picpuz.po
Languages: fr

source: open
fr: Ouvrir

source: open new image file
fr: Ouvrir un nouveau fichier image

source: set tile size
fr: Régler la taille des pièces

source: tile
fr: Pièces

source: mix
fr: Mél.

source: randomize tiles
fr: Mélanger les pièces

source: show
fr: Afficher

source: show image file
fr: Voir le modèle

source: save puzzle to a file
fr: Sauver le puzzle dans un fichier

source: toolbar::save
fr: Sauver

source: resume
fr: Repr.

source: resume saved puzzle
fr: Reprendre le puzzle sauvé

source: move one tile home
fr: Poser une pièce à sa place

source: change tile border line
fr: Changer la bordure des pièces

source: line
fr: ligne

source: quit
fr: Quitter

source: quit picpuz
fr: Quitter Picpuz

source: help
fr: Aide

source: view help document
fr: Voir le document d'aide

source: select image file
fr: Choisir un fichier image

source: cancel
fr: Annuler

source: change tile size
fr: Changer la taille des pièces

source: new tile size (pixels)
fr: Nouvelle taille des pièces (pixels)

source: cannot open: %s
fr: impossible d'ouvrir: %s

source: load puzzle from file
fr: Charger un puzzle depuis un fichier

source: saved puzzle file is not valid
fr: Mauvais format de fichier

source: DISCARD unfinished puzzle?
fr: Ne PAS garder le puzzle inachevé?

source: image type not recognized: %s
fr: Type d'image non reconnu: %s

source: image too small, please select another
fr: Image trop petite, choisissez en une autre

source: tiles home: %d/%d
fr: Pièces en place: %d/%d

source: 1st tile selected
fr: Première pièce sélectionnée

source: help file not found: %s
fr: impossible de trouver le fichier d'aide : %s

source: error: %s
fr: Erreur : %s

source: cannot open file %s
fr: Impossible d'ouvrir le fichier %s

source: save screen to file
fr: Enregistrer l'écran dans un fichier

source: save
fr: Enregistrer

source: open folder
fr: Ouvrir

source: create folder
fr: Créer un dossier

source: hidden
fr: Caché

source: quality
fr: Qualité

source: JPG quality 0-100
fr: Qualité JPG 0-100

source: done
fr: Terminé

source: Initial parameters file created. Inspect and revise if necessary.
fr: Le fichier des paramètres initiaux a été crée. Vérifier et corriger si nécessaire.

source: load parameters from a file
fr: Charger les paramètres à partir d'un fichier

source: save parameters to a file
fr: Enregistrer les paramètres dans un fichier

source: edit parameters
fr: Éditer les paramètres

source: list all
fr: Lister Tous

source: load file
fr: Charger Fichier

source: save file
fr: Enreg. Fichier

source: add new
fr: Ajouter Nouveau

source: apply
fr: Appliquer

source: apply?
fr: Appliquer ?

source: (new parm name)
fr: (Nouveaux paramètres)

source: add parameter
fr: Ajouter le paramètre
